{Çàäàíèå ¹19
Äàíû 3 âåùåñòâåííûõ ÷èñëà. Âûâåñòè íà ıêğàí:
à) òå èç íèõ, êîòîğûå ïğèíàäëåæàò èíòåğâàëó   1,6 — 3,8}
var
a, b, c: real;
begin
read(a, b, c);
if(a > 1.6)and(a < 3.8)then
begin 
writeln(a);
end
else
begin
writeln(' ×èñëî a íå âõîäèò â äàííûé èíòåğâàë.');
end;
if (b > 1.6) and (b < 3.8) then 
begin
writeln(b);
end
else
begin
writeln(' ×èñëî b íå âõîäèò â äàííûé èíòåğâàë.');
end;
if (c > 1.6) and (c < 3.8) then 
begin
writeln(c);
end
else
begin
writeln(' ×èñëî c íå âõîäèò â äàííûé èíòåğâàë.');
end;
end.
{ïğîâåğî÷íûå äàííûå:0.0, 1.0, 4.0,
 (×èñëî a íå âõîäèò â äàííûé èíòåğâàë. 
 ×èñëî b íå âõîäèò â äàííûé èíòåğâàë.
 ×èñëî c íå âõîäèò â äàííûé èíòåğâàë.)
ïğîâåğî÷íûå äàííûå:-2.0, 3.0, 6.0, 
( ×èñëî a íå âõîäèò â äàííûé èíòåğâàë.
3
 ×èñëî c íå âõîäèò â äàííûé èíòåğâàë.)
ïğîâåğî÷íûå äàííûå:2.0, 10.0, 3.5
(2
 ×èñëî b íå âõîäèò â äàííûé èíòåğâàë.
3.5)
}