{Íàïèñàòü ïğîãğàììó, êîòîğàÿ ïî ââåäåííîìó íîìåğó äíÿ íåäåëè (öåëîìó ÷èñëó X îò 1 äî 7) âûäàåò íàçâàíèå äíÿ íåäåëè 
è êîëè÷åñòâî óğîêîâ â êëàññå â ıòîò äåíü ñëåäóşùèì îáğàçîì:
•	åñëè îíî äåëèòñÿ íà 7, âûâåñòè íà ıêğàí «âîñêğåñåíüå»; 
•	åñëè îñòàòîê îò äåëåíèÿ íà 7 ğàâåí 1, âûâåñòè «ïîíåäåëüíèê»; 
•	åñëè îñòàòîê îò äåëåíèÿ íà 7 ğàâåí 2, âûâåñòè «âòîğíèê»; 
•	åñëè îñòàòîê îò äåëåíèÿ íà 7 ğàâåí 3, âûâåñòè «ñğåäà»; 
•	åñëè îñòàòîê îò äåëåíèÿ íà 7 ğàâåí 4, âûâåñòè «÷åòâåğã»;
•	åñëè îñòàòîê îò äåëåíèÿ íà 7 ğàâåí 5, âûâåñòè «ïÿòíèöà»;
•	åñëè îñòàòîê îò äåëåíèÿ íà 7 ğàâåí 6, âûâåñòè «ñóááîòà». }
var x : integer;
begin
if (x>=1) and(x<=7) then
begin
case x of
1: (x mod 7) = 0: writeln ('Âîñêğåñåíüå');
2: x mod 7= 1: writeln ('Ïîíåäåëüíèê');
3: x mod 7 = 2: writeln('Âòîğíèê');
4: x mod 7 = 3: writeln('Ñğåäà');
5: x mod 7= 4: writeln ('×åòâåğã');
6: x mod 7 = 5: writeln('Ïÿòíèöà');
7: x mod 7 = 6: writeln ('Ñóááîòà');
end;
end
else writeln('Ââåäåíî íåâåğíîå ÷èñëî');
end.
