{Äàíû 3 âåùåñòâåííûõ ÷èñëà. Âûâåñòè íà ıêğàí:
òå èç íèõ, êîòîğûå ïğèíàäëåæàò èíòåğâàëó    0,7 — 5,1}
var a, b, c: real;
begin
read(a, b, c);
if(a > 0.7)and(a < 5.1)then
begin 
writeln(a);
end
else
begin
writeln(' ×èñëî a íå âõîäèò â äàííûé èíòåğâàë.');
end;
if (b > 0.7) and (b < 5.1) then 
begin
writeln(b);
end
else
begin
writeln(' ×èñëî b íå âõîäèò â äàííûé èíòåğâàë.');
end;
if (c > 0.7) and (c < 5.1) then 
begin
writeln(c);
end
else
begin
writeln(' ×èñëî c íå âõîäèò â äàííûé èíòåğâàë.');
end;
end.
{ïğîâåğî÷íûå äàííûå: 0.0, 0.5, 5.5
(×èñëî a íå âõîäèò â äàííûé èíòåğâàë.
 ×èñëî b íå âõîäèò â äàííûé èíòåğâàë.
 ×èñëî c íå âõîäèò â äàííûé èíòåğâàë.)
ïğîâåğî÷íûå äàííûå:1.0, 2.0, 3.0, (1, 2, 3)
ïğîâåğî÷íûå äàííûå:-3.0, 1.5, 4.7
( ×èñëî a íå âõîäèò â äàííûé èíòåğâàë.
1.5
4.7)}